---
type: ClipPlane
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 5
tags: [revit-api, class]
---

# ClipPlane

`Autodesk.Revit.DB.DirectContext3D.ClipPlane` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ClipPlane | 2017 | `public ClipPlane ( ClipPlane other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Normal | 2017 | `public XYZ Normal { get ; set ; }` |
| Property | Origin | 2017 | `public XYZ Origin { get ; set ; }` |